W6D4/Artwork_API/routes_and_controllers/app/controllers/comments_controller.rb

SELECT "comments".* FROM "comments" WHERE "comments"."user_id" = $1  [["user_id", 16]]
SELECT "comments".* FROM "comments" WHERE "comments"."artwork_id" = $1  [["artwork_id", 17]]
---
    def index

        if params.has_key?(:user_id)
                # index of nested resource
            @comment = Comment.where(user_id: params[:user_id])
        elsif params.has_key?(:artwork_id)
                # index of nested resource
            @comment = Comment.where(artwork_id: params[:artwork_id])
        else
                # index of top-level resource
            @comment = Comment.all