W6D4/Artwork_API/routes_and_controllers/app/controllers/users_controller.rb

    def index
        user = User.search(params[:username])
---
SELECT "users".* FROM "users"