W7D2/bluebird-apr-2020-master/app/controllers/application_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."session_token" = $1 LIMIT $2  [["session_token", "hP70U5rAaZDyoNIKIaQ__g"], ["LIMIT", 1]]
---
  def current_user # finds a user based on the cookie in the HTTP request
    @current_user ||= User.find_by(session_token: session[:session_token])