W7D2/bluebird-apr-2020-master/app/controllers/users_controller.rb

SELECT "users".* FROM "users"
---
  def index
    @users = User.all #ActiveRecord method

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def show
    @user = User.find(params[:id]) #pulling id from params

INSERT INTO "users" ("username", "created_at", "updated_at", "email", "age", "password_digest", "session_token") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    # user = User.new(username: params[:username], email: params[:email], age: params[:age]) too much work
    # user = User.new(params.require(:user).permit(:username, :email, :age))
    @user = User.new(user_params)

    if @user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 3]]
---
  def destroy
    redirect_to users_url if current_user.id != params[:id]
    user = User.find(params[:id])

    user.destroy