W7D2/bluebird-apr-2020-master/app/models/user.rb

UPDATE "users" SET "updated_at" = $1, "session_token" = $2 WHERE "users"."id" = $3  [["updated_at", "2020-05-19 18:10:33.241006"], ["session_token", "NGmdWYTfmnjAYwD4zAqN3Q"], ["id", 3]]
---
  def reset_session_token!
    self.session_token = SecureRandom::urlsafe_base64
    self.save!